### You have been hired as Data Analyst

Some student details are missing

Some marks are not recorded

The director want to identify the top Ranker

In [2]:
import numpy as np
import pandas as pd

In [3]:
data = {
    "Name" : ["Aman","Saurav","Karan","Subham","Abhishek",None,"Sameer"],
    "Age" : [22,23,None,22,25,24,26],
    "Marks" : [85,None,88,90,56,72,None],
    "Subject" : ["Math","Physics","Math","Chemistry","Math","Physics","Chemistry"]
}

In [4]:
print(data)

{'Name': ['Aman', 'Saurav', 'Karan', 'Subham', 'Abhishek', None, 'Sameer'], 'Age': [22, 23, None, 22, 25, 24, 26], 'Marks': [85, None, 88, 90, 56, 72, None], 'Subject': ['Math', 'Physics', 'Math', 'Chemistry', 'Math', 'Physics', 'Chemistry']}

In [5]:
df = pd.DataFrame(data)

## Task 1.2

Check Shape of dataset

Display data types of the columns

Generate Statistical Summary(mean,min,max)

In [6]:
df.shape

(7, 4)

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Name     6 non-null      object
 1   Age      6 non-null      float64
 2   Marks    5 non-null      float64
 3   Subject  7 non-null      object
dtypes: float64(2), object(2)
memory usage: 356.0+ bytes

In [8]:
df.describe().T

       count       mean        std   min    25%   50%    75%   max
Age      6.0  23.666667   1.632993  22.0  22.25  23.5  24.75  26.0
Marks    5.0  78.200000  14.254824  56.0  72.00  85.0  88.00  90.0

## Task filter and group data

Selection: Create a view showing ony Name and Marks Columns

Filtering: Select Student who have scored more than 80 marks

Complex Filtering : Select Student older than 22 who also scored more than 80

Aggregation: Count how many Students are enrolled in each Subject

In [9]:
df[["Name","Marks"]]

       Name  Marks
0      Aman   85.0
1    Saurav    NaN
2     Karan   88.0
3    Subham   90.0
4  Abhishek   56.0
5      None   72.0
6    Sameer    NaN

In [10]:
df[df["Marks"]>80]

     Name   Age  Marks    Subject
0    Aman  22.0   85.0       Math
2   Karan   NaN   88.0       Math
3  Subham  22.0   90.0  Chemistry

In [18]:
new = df[(df["Age"]>22)&(df["Marks"]>80)]

Empty DataFrame
Columns: [Name, Age, Marks, Subject]
Index: []

In [12]:
df["Subject"].value_counts()

Subject
Math         3
Physics      2
Chemistry    2
Name: count, dtype: int64

## Task Order the data to find ranker

Sort the df by 'Marks' in descending order

Use a specific Pandas function to find the top 2 highest scorers without sorting the whole df manually

Identify the Student with lowest marks

In [13]:
df.sort_values("Marks",ascending=False)

       Name   Age  Marks    Subject
3    Subham  22.0   90.0  Chemistry
2     Karan   NaN   88.0       Math
0      Aman  22.0   85.0       Math
5      None  24.0   72.0    Physics
4  Abhishek  25.0   56.0       Math
1    Saurav  23.0    NaN    Physics
6    Sameer  26.0    NaN  Chemistry

In [14]:
df.sort_values("Marks",ascending=False).head(2)

     Name   Age  Marks    Subject
3  Subham  22.0   90.0  Chemistry
2   Karan   NaN   88.0       Math

In [15]:
df.sort_values("Marks",ascending=True).head(1)

       Name   Age  Marks Subject
4  Abhishek  25.0   56.0    Math

## Handling Missing values

Calculate total number of missing values

filter and display the rows where 'Marks 'are missing

create new df called cleaned_df by removing any row that contain even a single missing value

compare the shape of cleaned_df vs original_df

In [19]:
df.isnull().sum()

Name       1
Age        1
Marks      2
Subject    0
dtype: int64

In [25]:
df["Marks"].isnull()

0    False
1     True
2    False
3    False
4    False
5    False
6     True
Name: Marks, dtype: bool

In [23]:
cleaned_df = df.dropna()

In [24]:
cleaned_df.shape, df.shape

((3, 4), (7, 4))

## Analyze the logic

1. Technical Q: Look at the 'Marks' columns in your output. Why are the values floats instead of integers

2. Technical Q: What is the risk of using inplace=True when dropping missing values

3. Business Q: based on the data , what specific feedback should you give to the admin team regarding the "name " column

1-  The values in the marks columns are floats instead of integers because it is by default set in pandas .

2- the risk of using inplace=True when dropping missing values that if we use this function it will change the original dataset

3- Based on the data , the feedback we should give to the admin regarding the name column that do try to avoid null values in any columns which causes incorrect data